#include "Musictable.h"


const MusicNote code Haruhikage_Main[] = {
    // === 片段1开始 ===
    { 1, 0*BEAT_MS_1 },  // 音符30 持续4拍
    { 2, 4*BEAT_MS_1 },  // 音符28 持续2拍
    { 3, 6*BEAT_MS_1 },  // 音符26 持续4拍
    { 2, 10*BEAT_MS_1 },  // 音符28 持续2拍
    { 1, 12*BEAT_MS_1 },  // 音符30 持续3拍
    { 4, 15*BEAT_MS_1 },  // 音符31 持续1拍
    { 1, 16*BEAT_MS_1 },  // 音符30 持续2拍
    { 2, 18*BEAT_MS_1 },  // 音符28 持续5拍
    { 1, 23*BEAT_MS_1 },  // 音符30 持续4拍
    { 2, 27*BEAT_MS_1 },  // 音符28 持续2拍
    { 3, 29*BEAT_MS_1 },  // 音符26 持续4拍
    { 2, 33*BEAT_MS_1 },  // 音符28 持续2拍
    { 1, 35*BEAT_MS_1 },  // 音符30 持续3拍
    { 4, 38*BEAT_MS_1 },  // 音符31 持续1拍
    { 1, 39*BEAT_MS_1 },  // 音符30 持续2拍
    { 2, 41*BEAT_MS_1 },  // 音符28 持续5拍
    { 1, 46*BEAT_MS_1 },  // 音符30 持续4拍
    { 2, 50*BEAT_MS_1 },  // 音符28 持续2拍
    { 3, 52*BEAT_MS_1 },  // 音符26 持续4拍
    { 2, 56*BEAT_MS_1 },  // 音符28 持续2拍
    { 1, 58*BEAT_MS_1 },  // 音符30 持续3拍
    { 4, 61*BEAT_MS_1 },  // 音符31 持续1拍
    { 1, 62*BEAT_MS_1 },  // 音符30 持续2拍
    { 2, 64*BEAT_MS_1 },  // 音符28 持续5拍
    { 1, 69*BEAT_MS_1 },  // 音符30 持续4拍
    { 2, 73*BEAT_MS_1 },  // 音符28 持续2拍
    { 3, 75*BEAT_MS_1 },  // 音符26 持续4拍
    { 2, 79*BEAT_MS_1 },  // 音符28 持续2拍
    { 1, 81*BEAT_MS_1 },  // 音符30 持续3拍
    { 4, 84*BEAT_MS_1 },  // 音符31 持续1拍
    { 1, 85*BEAT_MS_1 },  // 音符30 持续2拍
    { 2, 87*BEAT_MS_1 },  // 音符28 持续5拍
    { 1, 92*BEAT_MS_1 },  // 音符14 持续1拍
    { 4, 93*BEAT_MS_1 },  // 音符16 持续1拍
    { 3, 94*BEAT_MS_1 },  // 音符18 持续2拍
    { 3, 96*BEAT_MS_1 },  // 音符18 持续2拍
    { 4, 98*BEAT_MS_1 },  // 音符16 持续2拍
    { 2, 100*BEAT_MS_1 },  // 音符19 持续2拍
    { 3, 102*BEAT_MS_1 },  // 音符18 持续2拍
    { 4, 104*BEAT_MS_1 },  // 音符16 持续2拍
    { 4, 106*BEAT_MS_1 },  // 音符16 持续2拍
    { 4, 108*BEAT_MS_1 },  // 音符16 持续2拍
    { 1, 110*BEAT_MS_1 },  // 音符14 持续1拍
    { 1, 111*BEAT_MS_1 },  // 音符14 持续1拍
    { 2, 112*BEAT_MS_1 },  // 音符19 持续2拍
    { 3, 114*BEAT_MS_1 },  // 音符18 持续2拍
    { 4, 116*BEAT_MS_1 },  // 音符16 持续2拍
    { 4, 118*BEAT_MS_1 },  // 音符16 持续4拍
    { 1, 122*BEAT_MS_1 },  // 音符14 持续1拍
    { 4, 123*BEAT_MS_1 },  // 音符16 持续1拍
    { 3, 124*BEAT_MS_1 },  // 音符18 持续5拍
    { 3, 129*BEAT_MS_1 },  // 音符18 持续2拍
    { 1, 131*BEAT_MS_1 },  // 音符21 持续2拍
    { 3, 133*BEAT_MS_1 },  // 音符26 持续2拍
    { 3, 135*BEAT_MS_1 },  // 音符25 持续4拍
    { 3, 139*BEAT_MS_1 },  // 音符26 持续2拍
    { 3, 141*BEAT_MS_1 },  // 音符25 持续4拍
    { 3, 145*BEAT_MS_1 },  // 音符26 持续2拍
    { 3, 147*BEAT_MS_1 },  // 音符25 持续1拍
    { 4, 148*BEAT_MS_1 },  // 音符23 持续1拍
    { 1, 149*BEAT_MS_1 },  // 音符21 持续4拍
    { 1, 153*BEAT_MS_1 },  // 音符21 持续2拍
    { 4, 155*BEAT_MS_1 },  // 音符16 持续2拍
    { 2, 157*BEAT_MS_1 },  // 音符19 持续2拍
    { 2, 159*BEAT_MS_1 },  // 音符19 持续4拍
    { 3, 163*BEAT_MS_1 },  // 音符18 持续2拍
    { 3, 165*BEAT_MS_1 },  // 音符18 持续4拍
    { 3, 169*BEAT_MS_1 },  // 音符9 持续2拍
    { 2, 171*BEAT_MS_1 },  // 音符19 持续2拍
    { 3, 173*BEAT_MS_1 },  // 音符18 持续2拍
    { 4, 175*BEAT_MS_1 },  // 音符16 持续2拍
    { 3, 177*BEAT_MS_1 },  // 音符18 持续4拍
    { 1, 181*BEAT_MS_1 },  // 音符21 持续2拍
    { 1, 183*BEAT_MS_1 },  // 音符14 持续5拍
    { 1, 188*BEAT_MS_1 },  // 音符14 持续2拍
    { 4, 190*BEAT_MS_1 },  // 音符16 持续2拍
    { 1, 192*BEAT_MS_1 },  // 音符14 持续3拍
    { 1, 195*BEAT_MS_1 },  // 音符14 持续1拍
    { 1, 196*BEAT_MS_1 },  // 音符14 持续2拍
    { 1, 198*BEAT_MS_1 },  // 音符21 持续2拍
    { 1, 200*BEAT_MS_1 },  // 音符14 持续2拍
    { 2, 202*BEAT_MS_1 },  // 音符19 持续4拍
    { 3, 206*BEAT_MS_1 },  // 音符18 持续2拍
    { 4, 208*BEAT_MS_1 },  // 音符16 持续4拍
    { 1, 212*BEAT_MS_1 },  // 音符14 持续2拍
    // === 片段1结束（累计214拍） ===
};


const MusicNote code FlowerTower_Main[] = {
    // === 片段1开始 ===
    { 1, 0*BEAT_MS_2 },  // 音符30 持续4拍
    { 2, 4*BEAT_MS_2 },  // 音符28 持续2拍
    { 3, 6*BEAT_MS_2 },  // 音符26 持续4拍
    { 2, 10*BEAT_MS_2 },  // 音符28 持续2拍
    { 1, 12*BEAT_MS_2 },  // 音符30 持续3拍
    { 1, 15*BEAT_MS_2 },  // 音符31 持续1拍
    { 1, 16*BEAT_MS_2 },  // 音符30 持续2拍
    { 2, 18*BEAT_MS_2 },  // 音符28 持续5拍
    { 1, 23*BEAT_MS_2 },  // 音符30 持续4拍
    { 2, 27*BEAT_MS_2 },  // 音符28 持续2拍
    { 3, 29*BEAT_MS_2 },  // 音符26 持续4拍
    { 2, 33*BEAT_MS_2 },  // 音符28 持续2拍
    { 1, 35*BEAT_MS_2 },  // 音符30 持续3拍
    { 1, 38*BEAT_MS_2 },  // 音符31 持续1拍
    { 1, 39*BEAT_MS_2 },  // 音符30 持续2拍
    { 2, 41*BEAT_MS_2 },  // 音符28 持续5拍
    { 1, 46*BEAT_MS_2 },  // 音符30 持续4拍
    { 2, 50*BEAT_MS_2 },  // 音符28 持续2拍
    { 3, 52*BEAT_MS_2 },  // 音符26 持续4拍
    { 2, 56*BEAT_MS_2 },  // 音符28 持续2拍
    { 1, 58*BEAT_MS_2 },  // 音符30 持续3拍
    { 1, 61*BEAT_MS_2 },  // 音符31 持续1拍
    { 1, 62*BEAT_MS_2 },  // 音符30 持续2拍
    { 2, 64*BEAT_MS_2 },  // 音符28 持续5拍
    { 1, 69*BEAT_MS_2 },  // 音符30 持续4拍
    { 2, 73*BEAT_MS_2 },  // 音符28 持续2拍
    { 3, 75*BEAT_MS_2 },  // 音符26 持续4拍
    { 2, 79*BEAT_MS_2 },  // 音符28 持续2拍
    { 1, 81*BEAT_MS_2 },  // 音符30 持续3拍
    { 1, 84*BEAT_MS_2 },  // 音符31 持续1拍
    { 1, 85*BEAT_MS_2 },  // 音符30 持续2拍
    { 2, 87*BEAT_MS_2 },  // 音符28 持续5拍
    { 1, 92*BEAT_MS_2 },  // 音符14 持续1拍
    { 4, 93*BEAT_MS_2 },  // 音符16 持续1拍
    { 3, 94*BEAT_MS_2 },  // 音符18 持续2拍
    { 3, 96*BEAT_MS_2 },  // 音符18 持续2拍
    { 4, 98*BEAT_MS_2 },  // 音符16 持续2拍
    { 2, 100*BEAT_MS_2 },  // 音符19 持续2拍
    { 3, 102*BEAT_MS_2 },  // 音符18 持续2拍
    { 4, 104*BEAT_MS_2 },  // 音符16 持续2拍
    { 4, 106*BEAT_MS_2 },  // 音符16 持续2拍
    { 4, 108*BEAT_MS_2 },  // 音符16 持续2拍
    { 1, 110*BEAT_MS_2 },  // 音符14 持续1拍
    { 1, 111*BEAT_MS_2 },  // 音符14 持续1拍
    { 2, 112*BEAT_MS_2 },  // 音符19 持续2拍
    { 3, 114*BEAT_MS_2 },  // 音符18 持续2拍
    { 4, 116*BEAT_MS_2 },  // 音符16 持续2拍
    { 4, 118*BEAT_MS_2 },  // 音符16 持续4拍
    { 1, 122*BEAT_MS_2 },  // 音符14 持续1拍
    { 4, 123*BEAT_MS_2 },  // 音符16 持续1拍
    { 3, 124*BEAT_MS_2 },  // 音符18 持续5拍
    { 3, 134*BEAT_MS_2 },  // 音符18 持续2拍
    { 1, 136*BEAT_MS_2 },  // 音符21 持续2拍
    { 3, 138*BEAT_MS_2 },  // 音符26 持续2拍
    { 3, 140*BEAT_MS_2 },  // 音符25 持续4拍
    { 3, 144*BEAT_MS_2 },  // 音符26 持续2拍
    { 3, 146*BEAT_MS_2 },  // 音符25 持续4拍
    { 3, 150*BEAT_MS_2 },  // 音符26 持续2拍
    { 3, 152*BEAT_MS_2 },  // 音符25 持续1拍
    { 4, 153*BEAT_MS_2 },  // 音符23 持续1拍
    { 1, 154*BEAT_MS_2 },  // 音符21 持续4拍
    { 1, 158*BEAT_MS_2 },  // 音符21 持续2拍
    { 4, 160*BEAT_MS_2 },  // 音符16 持续2拍
    { 2, 162*BEAT_MS_2 },  // 音符19 持续2拍
    { 2, 164*BEAT_MS_2 },  // 音符19 持续4拍
    { 3, 168*BEAT_MS_2 },  // 音符18 持续2拍
    { 3, 170*BEAT_MS_2 },  // 音符18 持续4拍
    { 3, 174*BEAT_MS_2 },  // 音符9 持续2拍
    { 2, 176*BEAT_MS_2 },  // 音符19 持续2拍
    { 3, 178*BEAT_MS_2 },  // 音符18 持续2拍
    { 4, 180*BEAT_MS_2 },  // 音符16 持续2拍
    { 3, 182*BEAT_MS_2 },  // 音符18 持续4拍
    { 1, 186*BEAT_MS_2 },  // 音符21 持续2拍
    { 1, 188*BEAT_MS_2 },  // 音符14 持续5拍
    { 1, 197*BEAT_MS_2 },  // 音符14 持续2拍
    { 4, 199*BEAT_MS_2 },  // 音符16 持续2拍
    { 1, 201*BEAT_MS_2 },  // 音符14 持续3拍
    { 1, 204*BEAT_MS_2 },  // 音符14 持续1拍
    { 1, 205*BEAT_MS_2 },  // 音符14 持续2拍
    { 1, 207*BEAT_MS_2 },  // 音符21 持续2拍
    { 1, 209*BEAT_MS_2 },  // 音符14 持续2拍
    { 2, 211*BEAT_MS_2 },  // 音符19 持续4拍
    { 3, 215*BEAT_MS_2 },  // 音符18 持续2拍
    { 4, 217*BEAT_MS_2 },  // 音符16 持续4拍
    { 1, 221*BEAT_MS_2 },  // 音符14 持续2拍
    // === 片段1结束（累计223拍） ===
};


const uint8_t code Haruhikage1[][2] = {
    //1
    {30,4}, {28,2}, {26,4}, {28,2},
    
    //2
    {30,3}, {31,1}, {30,2}, {28,5},
    
    //3
    {30,4}, {28,2}, {26,4}, {28,2},
    
    //4
    {30,3}, {31,1}, {30,2}, {28,5},
    
    //5
    {30,4}, {28,2}, {26,4}, {28,2},
    
    //6
    {30,3}, {31,1}, {30,2}, {28,5},
    
    //7
    {30,4}, {28,2}, {26,4}, {28,2},
    
    //8
    {30,3}, {31,1}, {30,2}, {28,5}, {14,1}, {16,1},
    
    //9
    {18,2}, {18,2}, {16,2}, {19,2}, {18,2}, {16,2},
    
    //10
    {16,2}, {16,2}, {14,1}, {14,1}, {19,2}, {18,2}, {16,2},
    
    //11
    {16,4}, {14,1}, {16,1}, {18,5},
    
    //12
    {0,5}, {18,2}, {21,2}, {26,2},
    
    //13
    {25,4}, {26,2}, {25,4}, {26,2},
    
    //14
    {25,1}, {23,1}, {21,4}, {21,2}, {16,2}, {19,2},
    
    //15
    {19,4}, {18,2}, {18,4}, {9,2},
    
    //16
    {19,2}, {18,2}, {16,2}, {18,4}, {21,2},
    
    //17
    {14,5}, {0,4}, {14,2},
    
    //18
    {16,2}, {14,3}, {14,1}, {14,2}, {21,2}, {14,2},
    
    //19
    {19,4}, {18,2}, {16,4}, {14,2},
    
    {0xFF, 0}  // 终止
};

// const uint8_t code Haruhikage2[][2] = {
//     //20
//     {14,5}, {0,4}, {14,1}, {16,1},
    
//     //21
//     {18,2}, {18,2}, {16,2}, {19,2}, {18,2}, {16,2},
    
//     //22
//     {16,2}, {16,2}, {14,2}, {19,2}, {18,2}, {16,2},
    
//     //23
//     {16,4}, {14,1}, {16,1}, {18,5},
    
//     //24
//     {0,5}, {18,2}, {21,2}, {26,2},
    
//     //25
//     {25,4}, {26,2}, {25,4}, {26,2},
    
//     //26
//     {25,1}, {23,1}, {21,4}, {21,2}, {16,2}, {19,2},
    
//     //27
//     {19,4}, {18,2}, {18,4}, {9,2},
    
//     //28
//     {19,2}, {18,2}, {16,2}, {18,4}, {21,2},
    
//     //29
//     {14,5}, {0,4}, {14,1}, {14,1},
    
//     //30
//     {16,2}, {14,4}, {14,2}, {21,2}, {14,2},
    
//     //31
//     {19,2}, {19,1}, {19,1}, {18,1}, {16,1}, {16,4}, {14,2},
    
//     //32
//     {14,3}, {0,3}, {0,5},
    
//     //33
//     {35,2}, {33,2}, {33,2}, {33,2}, {31,2}, {31,2},
    
//     //34
//     {30,2}, {28,2}, {28,2}, {28,2}, {0,2}, {21,2},
    
//     //35
//     {21,2}, {19,1}, {19,1}, {19,2}, {19,2}, {18,2}, {16,2},
    
//     //36
//     {16,4}, {14,1}, {13,1}, {14,3}, {0,3},
    
//     //37
//     {35,2}, {33,2}, {33,2}, {33,2}, {31,2}, {31,2},
    
//     //38
//     {30,2}, {28,2}, {28,2}, {28,2}, {0,2}, {18,2},
    
//     //39
//     {18,2}, {18,1}, {18,1}, {18,1}, {18,1}, {18,2}, {16,2}, {18,2},
    
//     {0xFF, 0}  // 终止
// };

// const uint8_t code Haruhikage3[][2] = {
//     //40
//     {28,4}, {26,2}, {26,2}, {0,2}, {26,2},
    
//     //41
//     {25,4}, {23,2}, {23,5},
    
//     //42
//     {0,4}, {23,2}, {23,2}, {21,2}, {19,1}, {19,1},
    
//     //43
//     {19,5}, {18,1}, {19,1}, {21,9}, {0,5},
    
//     //44
//     {18,1}, {16,1}, {18,1}, {16,1}, {18,1}, {19,1}, {21,2}, {0,2}, {19,1}, {21,1},
    
//     //45
//     {23,2}, {0,2}, {23,1}, {25,1}, {26,2}, {0,2}, {28,1}, {16,1},
    
//     //46
//     {21,4}, {0,1}, {14,1}, {21,2}, {19,2}, {19,2},
    
//     //47
//     {18,4}, {18,1}, {19,1}, {21,4}, {0,2},
    
//     //48
//     {18,1}, {16,1}, {18,1}, {16,1}, {18,1}, {19,1}, {21,2}, {0,2}, {19,1}, {21,1},
    
//     //49
//     {23,2}, {0,2}, {22,1}, {23,1}, {25,2}, {0,3}, {18,1},
    
//     //50
//     {30,2}, {30,2}, {0,1}, {18,1}, {31,2}, {30,2}, {28,2},
    
//     //51
//     {28,4}, {26,1}, {25,1}, {26,2}, {0,2}, {21,1}, {26,1},
    
//     //52
//     {28,4}, {26,2}, {26,2}, {0,2}, {21,2},
    
//     //53
//     {28,4}, {26,2}, {26,2}, {0,2}, {21,1}, {26,1},
    
//     //54
//     {28,4}, {26,2}, {26,2}, {0,2}, {21,1}, {26,1},
    
//     //55
//     {28,3}, {30,1}, {28,2}, {26,2}, {0,2}, {16,2},
    
//     //56
//     {25,4}, {23,2}, {23,2}, {0,2}, {21,2},
    
//     //57
//     {21,4}, {19,2}, {19,2}, {18,2}, {16,2},
    
//     //58
//     {18,5}, {0,5},
    
//     //59
//     {18,2}, {19,2}, {18,2}, {19,2}, {18,2}, {16,2},
    
//     //60
//     {14,10},
    
//     {0xFF, 0}  // 终止
// };

const uint8_t code Flowertower[][2] = {
    // 1
    {H5, 2}, {H4, 2}, {P, 2}, {H2, 2}, {H1, 2}, {P, 2}, {M6, 2}, {M6_, 2},
    
    // 2
    {P, 2}, {H4, 2}, {M4, 2}, {M6_, 1}, {H1, 1}, {H2, 2}, {H1, 2}, {M6_, 4},
    
    // 3
    {H5, 2}, {H4, 2}, {P, 2}, {H2, 2}, {H1, 2}, {P, 2}, {M6, 2}, {M6_, 2},
    
    // 4
    {P, 2}, {H4, 2}, {M4, 2}, {M6_, 1}, {H1, 1}, {H2, 2}, {H1, 2}, {M6_, 4},
    
    // 5
    {H5, 2}, {H4, 2}, {P, 2}, {H2, 2}, {H1, 2}, {P, 2}, {M6, 2}, {M6_, 2},
    
    // 6
    {P, 2}, {H4, 2}, {M4, 2}, {M6_, 1}, {H1, 1}, {H6_, 2}, {H6, 2}, {H4, 4},
    
    // 7
    {H5, 2}, {H4, 2}, {P, 2}, {H2, 2}, {H1, 2}, {P, 2}, {M6, 2}, {M6_, 2},
    
    // 8
    {P, 2}, {H4, 2}, {M4, 2}, {M6_, 1}, {H1, 1}, {H2, 2}, {H1, 2}, {M6_, 4},
    
    // 9
    {H2, 2}, {M4, 2}, {M4, 2}, {H1, 2}, {M4, 2}, {M6, 2}, {M6_, 2}, {H4, 2},
    
    // 10
    {H4, 4+4}, {H4, 2}, {M2, 2}, {M1, 2}, {L6_, 2},
    
    // 11
    {L6_, 2}, {M1, 2}, {M2, 2}, {M4, 2}, {P, 2}, {L6_, 4}, {M1, 2},
    
    // 12
    {M1, 4+2}, {M2, 2}, {P, 2}, {M2, 2}, {M1, 2}, {L6_, 2},
    
    // 13
    {L6_, 2}, {M1, 4}, {M6, 2+2}, {L6_, 2}, {L6_, 2}, {M1, 2},
    
    // 14
    {M1, 2}, {L6_, 4}, {L6, 2}, {L6_, 4}, {P, 4},
    
    // 15 16
    {M6_, 4+2}, {M6_, 2}, {M5, 2}, {M4, 2}, {M4, 2}, {M4, 2+2}, {M6_, 2}, {M6_, 2}, {H1, 2}, {H2, 2}, {P, 2}, {M4, 2}, {M4, 2},
    
    // 17  18
    {M4, 2}, {M6_, 2}, {H1, 2}, {H2, 2+2}, {H1, 2+2}, {M4, 2+2}, {M6_, 2}, {M6_, 2}, {H1, 2}, {H1, 2}, {P, 2}, {M6_, 4},
    
    // 19
    {P, 4}, {P, 2}, {M6_, 2}, {M6_, 2}, {M6, 2}, {M4, 2}, {M4, 2},
    
    // 20
    {M4, 4}, {M4, 2}, {M4, 2+2}, {M2_, 2}, {M2, 2}, {L6_, 2},
    
    // 21
    {L6_, 2}, {M1, 2}, {M2, 2}, {L6_, 2}, {L6_, 2}, {M1, 2}, {M2, 2}, {L6_, 2},
    
    // 22
    {L6_, 2}, {M1, 2}, {L6_, 2}, {L6_, 2}, {L6_, 2}, {M6_, 2+2}, {M6, 2},
    
    // 23 24
    {M6_, 4}, {P, 2}, {M6_, 2}, {M6_, 4}, {H2, 2}, {H1, 2+2}, {M6_, 2}, {P, 2}, {M6_, 2}, {H1, 2}, {M6_, 2+2}, {M6_, 2},
    
    // 25 26
    {M6, 4+2}, {P, 2}, {M6, 4}, {M6_, 2}, {H1, 2},
    
    // 26
    {H1, 4+4+4+4},
    
    // 27
    {P, 4}, {P, 4}, {P, 4}, {M4_, 2}, {M4_, 2},
    
    // 28
    {M7, 4}, {H1_, 4}, {H2_, 4}, {H1_, 4},
    
    // 29
    {M7, 4}, {M7, 4+4}, {M7, 4},
    
    // 30
    {H1_, 4}, {M7, 4+4}, {H2_, 2}, {H1_, 2},
    
    // 31
    {H2_, 4+2}, {P, 2}, {P, 4}, {M4, 2}, {M4, 2},
    
    // 32
    {M7, 4}, {H1_, 4}, {H2_, 4}, {H1_, 4},
    
    // 33
    {M7, 4}, {M7, 4}, {P, 4}, {M7, 4},
    
    // 34
    {H1_, 4}, {M7, 4}, {H3, 4}, {H2_, 2}, {H1_, 2},
    
    // 35
    {H1_, 4+4}, {H2_, 4}, {P, 4},
    
    // 37
    {M7, 4}, {H1_, 4}, {H4_, 4}, {H1_, 2}, {M7, 2},
    
    // 38
    {M7, 2}, {P, 2}, {M4_, 4}, {M4_, 4+4},
    
    // 39
    {H1_, 2}, {M7, 2}, {M7, 4}, {H1_, 4}, {H3, 4},
    
    // 40
    {H2_, 4}, {H3, 4}, {H2_, 4}, {H1_, 2}, {M7, 2},
    
    // 41
    {M7, 4}, {P, 4}, {M7, 4+4},
    
    // 42
    {M7, 4+2}, {P, 2}, {H2_, 4+4},
    
    // 43
    {H1_, 4+4}, {M7, 4},
    
    // 44
    {M6_, 4+2}, {P, 2}, {P, 4}, {M4_, 2}, {M4_, 2},
    
    // 45
    {M7, 4}, {H1_, 4}, {H2_, 4}, {H1_, 4},
    
    // 46
    {M7, 4}, {M7, 4+4}, {M7, 4},
    
    // 47
    {M5_, 2}, {M6_, 2}, {M6_, 4+4}, {M5_, 2}, {M4_, 2},
    
    // 48
    {M4_, 4+4}, {P, 4}, {M4_, 2}, {M4_, 2},
    
    // 49
    {M7, 4}, {H1_, 4}, {H2_, 4}, {H1_, 4},
    
    // 50
    {M7, 4}, {M7, 4}, {P, 4}, {M7, 4},
    
    // 51
    {H1_, 4+4+4}, {H1_, 2}, {H2_, 2},
    
    // 52
    {H2_, 4+2}, {P, 2}, {P, 4}, {M7, 2}, {M7, 2},
    
    // 53
    {M7, 4}, {H1_, 4}, {H4_, 2}, {M7, 2}, {M7, 4},
    
    // 54
    {M7, 4}, {H4_, 4}, {H4_, 2}, {P, 2}, {M7, 2}, {M7, 2},
    
    // 55
    {M7, 4}, {H4_, 4}, {H4_, 2}, {H1_, 2}, {M6_, 4},
    
    // 56
    {M7, 4}, {H4_, 4}, {H4_, 2}, {P, 2}, {H4_, 2}, {H4_, 2},
    
    // 57
    {M4_, 4}, {M7, 4}, {P, 4}, {M4_, 4},
    
    // 58
    {M4_, 4}, {M7, 4}, {M7, 4}, {H2_, 2}, {H1_, 2},
    
    // 59
    {H1_, 4}, {P, 4}, {M7, 4}, {H2_, 2}, {H3, 2},
    
    // 60
    {H3, 4}, {H2_, 4}, {M7, 4}, {M6_, 4},
    
    {M7, 4+4+4+4},
    
    {0xFF, 0}  // 终止
};

const uint8_t code Emptybox[][2] = {
	
	/*
	空の箱 - 井芹仁菜、河原木桃香
	*/
	/* 第一段 */

	{M5,1},{M5,1},{H2,3},{H1,3},{H2,4},{H2,4},{M5,1},{M5,1},{H2,3},{H1,3},{H2,4},{H2,4},{P,2},
		//やけに白いんだ　やたら長いんだ
	{M5,1},{M5,1},{H2,3},{H1,3},{H3,4},{H3,4},{M5,1},{M5,1},{H2,3},{H1,3},{H4,4},{H3,4},{M5,2},{H1,2},{H2,2},{H3,2},{M7,4},{M6,6},
		//コタエはだいたいカタチばかりの常識だろう
	{M5,4},{M5,2},{M5,3},{M2,3},{M4,2},{M4,3},{M7,3},{H1,2},{M7,6},{M6,2},{H1,12},{P,8},
		//指先が震えようとも 

	{M3,2},{M5,2},{M6,2},{M3,2},{M5,4},{H1,2},{M7,6},{H1,2},{M7,6},{M5,2},{M3,4},{M6,4},{M2,4},
		//地図にはないはずの三叉路に今
	{M2,1},{M2,1},{M2,4},{M2,2},{M3,2},{M5,2},{M3,6},{M2,1},{M2,3},{P,1},
		//ぶつかっているのですが
	{M2,4},{M3,2},{M5,4},{H1,2},{M7,6},{H1,2},{M7,6},{M5,2},{M3,4},{M5,2},{M7,2},{M7,8},{M6,4},{P,4},{M5,2},{M5,6},{M3,6},{P,2},
		//何を頼りに進めばいいのでしょうか
	{M3,2},{M7,3},{M3,1},{M2,2},{M3,2},{M5,2},{M3,2},{M2,2},{M3,2},{M5,2},{M6,2},{M5,2},{M3,2},{M2,4},{P,2},
		//教科書通りとはよく言ったもので
	{M5,2},{M5,3},{M4,1},{M4,2},{M3,2},{M3,2},{M2,2},{M3,2},{M4,2},{M3,4},{P,2},
		//難しい言葉だらけ
	{M2,4},{M5,2},{M6,2},{M3,2},{M5,4},{H1,2},{M7,6},{H1,2},{M7,6},{M5,2},{M4,4},{M3,2},{M2,2},{M2,6},{M3,2},{M3,4},{P,8},
		//今日(こんにち)あの頃から少しも変わらない
	
	{M3,4},{M5,2},{M7,4},{M6,4},{M5,4},{M3,2},{M7,4},{M6,4},{M5,4},{M3,2},{M3,2},{M2,6},{M3,2},{M3,4},{P,2},{M3,4},{M6,3},{M5,3},{M3,2},{M3,4},{P,2},
		//この空欄を埋めれば解けますか　いつの日か
	{M3,2},{M7,4},{M6,4},{M5,4},{M3,2},{M7,4},{M6,4},{M5,4},{M3,2},{M3,2},{M7,4},{H1,2},{M7,2},{H1,2},{M7,2},{H1,2},{H2,2},{M7,6},{P,2},
		//あなたならどうやって先へと進みますか
		
	{M5,1},{M5,1},{H2,3},{H1,3},{H2,4},{H2,4},{M5,1},{M5,1},{H2,3},{H1,3},{H2,4},{H2,4},{P,2},
		//やけに白いんだ　やたら長いんだ
	{M5,1},{M5,1},{H2,3},{H1,3},{H3,4},{H3,4},{M5,1},{M5,1},{H2,3},{H1,3},{H4,4},{H3,4},{M5,2},{H1,2},{H2,2},{H3,2},{M7,4},{M6,6},
		//コタエはだいたいカタチばかりの常識だろう
	{M5,4},{M5,2},{M5,3},{M2,3},{M4,2},{M4,3},{M7,3},{H1,2},{M7,6},{M6,2},{H1,8},{P,10},
		//指先が震えようとも 

	{M5,2},{H2,3},{H1,3},{H2,4},{H2,4},{M5,1},{M5,1},{H2,3},{H1,3},{H2,6},{H2,4},
		//正解は無いんだ　負けなんて無いんだ
	{M5,1},{M5,1},{H2,3},{H1,3},{H3,4},{H3,4},{M5,1},{M5,1},{H2,3},{H1,3},{H4,4},{H3,4},{M5,2},{H1,2},{H2,2},{H3,2},{M7,4},{M6,6},
		//あたしは生涯　あたしであってそれだけだろう
	{M5,2},{H2,2},{H2,4},{H1,8},{M5,2},{H2,2},{H2,4},{H1,2},{H2,1},{M5,1},{M5,1},{M3,2},{M5,2},{M7,2},{M7,4},{H1,2},{H1,8},{P,12},
		//これ以上かき乱しても明日はない
		
		/*第二段*/
	{M3,2},{M5,2},{M6,2},{M3,2},{M5,4},{H1,2},{M7,6},{H1,2},{M7,6},{M5,2},{M3,4},{M6,4},{M2,4},
		//役立たない地図の所為にして今
	{M2,1},{M2,1},{M2,4},{M2,2},{M3,2},{M5,2},{M3,6},{M2,1},{M2,3},{P,1},
		//途方に暮れていますが
	{M2,4},{M3,2},{M5,4},{H1,2},{M7,6},{H1,2},{M7,6},{M5,2},{M3,4},{M5,2},{M7,2},{M7,8},{M6,4},{P,4},{M5,2},{M5,6},{M3,6},{P,2},
		//強がったとして結果はおそらく同じ

	{M3,2},{H7,3},{M3,1},{M2,2},{M3,2},{M5,2},{M3,2},{M2,2},{M3,2},{M5,2},{M6,2},{M5,2},{M3,2},{M2,4},{P,2},
		//溢れだしそうなほど詰め込んだ
	{M5,2},{M5,3},{M4,1},{M4,2},{M3,2},{M3,2},{M2,2},{M3,2},{M4,2},{M3,4},{P,2},
		//他人の箱を横目に
	{M2,4},{M5,2},{M6,2},{M3,2},{M5,4},{H1,2},{M7,6},{H1,2},{M7,6},{M5,2},{M4,4},{M3,2},{M2,2},{M2,6},{M3,2},{M3,4},{P,8},
		//下手な愛想笑いすら　やっぱり出来てない

	{M3,4},{M5,2},{M7,4},{M6,4},{M5,4},{M3,2},{M7,4},{M6,4},{M5,4},{M3,2},{M3,2},{M2,6},{M3,2},{M3,4},{P,2},{M3,4},{M6,3},{M5,3},{M3,2},{M3,4},{P,2},
		//こんな空欄さえなければ　あなたも思うでしょう
	{M3,2},{M7,4},{M6,4},{M5,4},{M3,2},{M7,4},{M6,4},{M5,4},{M3,2},{M3,2},{M7,4},{H1,2},{M7,2},{H1,2},{M7,2},{H1,2},{H2,2},{M7,6},{P,8},
		//このままでいいなんて　それだけは間違いだ

	{M5,1},{M5,1},{H2,3},{H1,3},{H2,4},{H2,4},{M5,1},{M5,1},{H2,3},{H1,3},{H2,6},{H2,4},
		//空っぽなんだ　ひとつも無いんだ
	{M5,1},{M5,1},{H2,3},{H1,3},{H3,4},{H3,4},{M5,1},{M5,1},{H2,3},{H1,3},{H4,4},{H3,4},{M5,2},{H1,2},{H2,2},{H3,2},{M7,4},{M6,6},
		//無くなったのか　始まったのか分からないけど
	{M5,2},{M5,1},{M5,2},{M2,2},{M3,1},{M4,1},{M7,2},{H1,1},{M7,4},{M6,1},{H1,6},{P,1},
		//行くしか方法は無いんだろう？

	{M5,2},{H2,3},{H1,3},{H2,4},{H2,4},{M5,1},{M5,1},{H2,3},{H1,3},{H2,6},{H2,4},
		//正解は無いんだ　負けなんて無いんだ
	{M5,1},{M5,1},{H2,3},{H1,3},{H3,4},{H3,4},{M5,1},{M5,1},{H2,3},{H1,3},{H4,4},{H3,4},{M5,2},{H1,2},{H2,2},{H3,2},{M7,4},{M6,6},
		//あたしは生涯　あたしであってそれだけだろう
	{M5,2},{H2,2},{H2,4},{H1,8},{M5,2},{H2,2},{H2,4},{H1,2},{H2,1},{M5,1},{M5,1},{M3,2},{M5,2},{M7,2},{M7,4},{H1,2},{H1,8},{P,12},
		//これ以上かき乱しても明日はない
	{H3,8},{H2,4},{P,8},
	{M3,2},{H2,2},{H2,4},{H1,4},{M5,2},{M3,2},{M5,2},{M7,2},{M7,4},{H1,2},{H1,8},
		//どう足掻いても明日はない
	{STOP,1}
};

const MusicNote code EmptyBox_Main[] = {
    // === 片段1开始 ===
    { 2, 0*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 2*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 5*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 8*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 12*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 16*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 17*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 18*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 21*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 24*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 28*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 34*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 35*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 36*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 39*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 42*BEAT_MS_3 },  // 音符29 持续4拍
    { 1, 46*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 50*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 51*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 52*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 55*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 58*BEAT_MS_3 },  // 音符30 持续4拍
    { 1, 62*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 66*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 68*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 70*BEAT_MS_3 },  // 音符27 持续2拍
    { 1, 72*BEAT_MS_3 },  // 音符29 持续2拍
    { 4, 74*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 78*BEAT_MS_3 },  // 音符22 持续6拍
    { 2, 84*BEAT_MS_3 },  // 音符20 持续4拍
    { 2, 88*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 90*BEAT_MS_3 },  // 音符20 持续3拍
    { 4, 93*BEAT_MS_3 },  // 音符15 持续3拍
    { 3, 96*BEAT_MS_3 },  // 音符18 持续2拍
    { 3, 98*BEAT_MS_3 },  // 音符18 持续3拍
    { 4, 101*BEAT_MS_3 },  // 音符24 持续3拍
    { 3, 104*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 106*BEAT_MS_3 },  // 音符24 持续6拍
    { 1, 112*BEAT_MS_3 },  // 音符22 持续2拍
    { 3, 114*BEAT_MS_3 },  // 音符25 持续12拍
    { 3, 134*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 136*BEAT_MS_3 },  // 音符20 持续2拍
    { 1, 138*BEAT_MS_3 },  // 音符22 持续2拍
    { 3, 140*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 142*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 146*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 148*BEAT_MS_3 },  // 音符24 持续6拍
    { 3, 154*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 156*BEAT_MS_3 },  // 音符24 持续6拍
    { 2, 162*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 164*BEAT_MS_3 },  // 音符17 持续4拍
    { 1, 168*BEAT_MS_3 },  // 音符22 持续4拍
    { 4, 172*BEAT_MS_3 },  // 音符15 持续4拍
    { 4, 176*BEAT_MS_3 },  // 音符15 持续1拍
    { 4, 177*BEAT_MS_3 },  // 音符15 持续1拍
    { 4, 178*BEAT_MS_3 },  // 音符15 持续4拍
    { 4, 182*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 184*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 186*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 188*BEAT_MS_3 },  // 音符17 持续6拍
    { 4, 194*BEAT_MS_3 },  // 音符15 持续1拍
    { 4, 195*BEAT_MS_3 },  // 音符15 持续3拍
    { 4, 199*BEAT_MS_3 },  // 音符15 持续4拍
    { 3, 203*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 205*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 209*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 211*BEAT_MS_3 },  // 音符24 持续6拍
    { 3, 217*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 219*BEAT_MS_3 },  // 音符24 持续6拍
    { 2, 225*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 227*BEAT_MS_3 },  // 音符17 持续4拍
    { 2, 231*BEAT_MS_3 },  // 音符20 持续2拍
    { 4, 233*BEAT_MS_3 },  // 音符24 持续2拍
    { 4, 235*BEAT_MS_3 },  // 音符24 持续8拍
    { 1, 243*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 251*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 253*BEAT_MS_3 },  // 音符20 持续6拍
    { 3, 259*BEAT_MS_3 },  // 音符17 持续6拍
    { 3, 267*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 269*BEAT_MS_3 },  // 音符24 持续3拍
    { 3, 272*BEAT_MS_3 },  // 音符17 持续1拍
    { 4, 273*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 275*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 277*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 279*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 281*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 283*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 285*BEAT_MS_3 },  // 音符20 持续2拍
    { 1, 287*BEAT_MS_3 },  // 音符22 持续2拍
    { 2, 289*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 291*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 293*BEAT_MS_3 },  // 音符15 持续4拍
    { 2, 299*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 301*BEAT_MS_3 },  // 音符20 持续3拍
    { 2, 304*BEAT_MS_3 },  // 音符19 持续1拍
    { 2, 305*BEAT_MS_3 },  // 音符19 持续2拍
    { 3, 307*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 309*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 311*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 313*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 315*BEAT_MS_3 },  // 音符19 持续2拍
    { 3, 317*BEAT_MS_3 },  // 音符17 持续4拍
    { 4, 323*BEAT_MS_3 },  // 音符15 持续4拍
    { 2, 327*BEAT_MS_3 },  // 音符20 持续2拍
    { 1, 329*BEAT_MS_3 },  // 音符22 持续2拍
    { 3, 331*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 333*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 337*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 339*BEAT_MS_3 },  // 音符24 持续6拍
    { 3, 345*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 347*BEAT_MS_3 },  // 音符24 持续6拍
    { 2, 353*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 355*BEAT_MS_3 },  // 音符19 持续4拍
    { 3, 359*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 361*BEAT_MS_3 },  // 音符15 持续2拍
    { 4, 363*BEAT_MS_3 },  // 音符15 持续6拍
    { 3, 369*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 371*BEAT_MS_3 },  // 音符17 持续4拍
    { 3, 383*BEAT_MS_3 },  // 音符17 持续4拍
    { 2, 387*BEAT_MS_3 },  // 音符20 持续2拍
    { 4, 389*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 393*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 397*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 401*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 403*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 407*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 411*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 415*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 417*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 419*BEAT_MS_3 },  // 音符15 持续6拍
    { 3, 425*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 427*BEAT_MS_3 },  // 音符17 持续4拍
    { 3, 433*BEAT_MS_3 },  // 音符17 持续4拍
    { 1, 437*BEAT_MS_3 },  // 音符22 持续3拍
    { 2, 440*BEAT_MS_3 },  // 音符20 持续3拍
    { 3, 443*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 445*BEAT_MS_3 },  // 音符17 持续4拍
    { 3, 451*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 453*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 457*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 461*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 465*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 467*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 471*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 475*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 479*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 481*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 483*BEAT_MS_3 },  // 音符24 持续4拍
    { 3, 487*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 489*BEAT_MS_3 },  // 音符24 持续2拍
    { 3, 491*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 493*BEAT_MS_3 },  // 音符24 持续2拍
    { 3, 495*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 497*BEAT_MS_3 },  // 音符27 持续2拍
    { 4, 499*BEAT_MS_3 },  // 音符24 持续6拍
    { 2, 507*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 508*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 509*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 512*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 515*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 519*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 523*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 524*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 525*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 528*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 531*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 535*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 541*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 542*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 543*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 546*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 549*BEAT_MS_3 },  // 音符29 持续4拍
    { 1, 553*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 557*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 558*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 559*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 562*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 565*BEAT_MS_3 },  // 音符30 持续4拍
    { 1, 569*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 573*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 575*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 577*BEAT_MS_3 },  // 音符27 持续2拍
    { 1, 579*BEAT_MS_3 },  // 音符29 持续2拍
    { 4, 581*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 585*BEAT_MS_3 },  // 音符22 持续6拍
    { 2, 591*BEAT_MS_3 },  // 音符20 持续4拍
    { 2, 595*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 597*BEAT_MS_3 },  // 音符20 持续3拍
    { 4, 600*BEAT_MS_3 },  // 音符15 持续3拍
    { 3, 603*BEAT_MS_3 },  // 音符18 持续2拍
    { 3, 605*BEAT_MS_3 },  // 音符18 持续3拍
    { 4, 608*BEAT_MS_3 },  // 音符24 持续3拍
    { 3, 611*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 613*BEAT_MS_3 },  // 音符24 持续6拍
    { 1, 619*BEAT_MS_3 },  // 音符22 持续2拍
    { 3, 621*BEAT_MS_3 },  // 音符25 持续8拍
    { 2, 639*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 641*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 644*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 647*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 651*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 655*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 656*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 657*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 660*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 663*BEAT_MS_3 },  // 音符27 持续6拍
    { 2, 669*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 673*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 674*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 675*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 678*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 681*BEAT_MS_3 },  // 音符29 持续4拍
    { 1, 685*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 689*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 690*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 691*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 694*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 697*BEAT_MS_3 },  // 音符30 持续4拍
    { 1, 701*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 705*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 707*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 709*BEAT_MS_3 },  // 音符27 持续2拍
    { 1, 711*BEAT_MS_3 },  // 音符29 持续2拍
    { 4, 713*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 717*BEAT_MS_3 },  // 音符22 持续6拍
    { 2, 723*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 725*BEAT_MS_3 },  // 音符27 持续2拍
    { 2, 727*BEAT_MS_3 },  // 音符27 持续4拍
    { 3, 731*BEAT_MS_3 },  // 音符25 持续8拍
    { 2, 739*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 741*BEAT_MS_3 },  // 音符27 持续2拍
    { 2, 743*BEAT_MS_3 },  // 音符27 持续4拍
    { 3, 747*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 749*BEAT_MS_3 },  // 音符27 持续1拍
    { 2, 750*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 751*BEAT_MS_3 },  // 音符20 持续1拍
    { 3, 752*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 754*BEAT_MS_3 },  // 音符20 持续2拍
    { 4, 756*BEAT_MS_3 },  // 音符24 持续2拍
    { 4, 758*BEAT_MS_3 },  // 音符24 持续4拍
    { 3, 762*BEAT_MS_3 },  // 音符25 持续2拍
    { 3, 764*BEAT_MS_3 },  // 音符25 持续8拍
    { 3, 784*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 786*BEAT_MS_3 },  // 音符20 持续2拍
    { 1, 788*BEAT_MS_3 },  // 音符22 持续2拍
    { 3, 790*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 792*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 796*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 798*BEAT_MS_3 },  // 音符24 持续6拍
    { 3, 804*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 806*BEAT_MS_3 },  // 音符24 持续6拍
    { 2, 812*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 814*BEAT_MS_3 },  // 音符17 持续4拍
    { 1, 818*BEAT_MS_3 },  // 音符22 持续4拍
    { 4, 822*BEAT_MS_3 },  // 音符15 持续4拍
    { 4, 826*BEAT_MS_3 },  // 音符15 持续1拍
    { 4, 827*BEAT_MS_3 },  // 音符15 持续1拍
    { 4, 828*BEAT_MS_3 },  // 音符15 持续4拍
    { 4, 832*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 834*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 836*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 838*BEAT_MS_3 },  // 音符17 持续6拍
    { 4, 844*BEAT_MS_3 },  // 音符15 持续1拍
    { 4, 845*BEAT_MS_3 },  // 音符15 持续3拍
    { 4, 849*BEAT_MS_3 },  // 音符15 持续4拍
    { 3, 853*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 855*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 859*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 861*BEAT_MS_3 },  // 音符24 持续6拍
    { 3, 867*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 869*BEAT_MS_3 },  // 音符24 持续6拍
    { 2, 875*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 877*BEAT_MS_3 },  // 音符17 持续4拍
    { 2, 881*BEAT_MS_3 },  // 音符20 持续2拍
    { 4, 883*BEAT_MS_3 },  // 音符24 持续2拍
    { 4, 885*BEAT_MS_3 },  // 音符24 持续8拍
    { 1, 893*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 901*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 903*BEAT_MS_3 },  // 音符20 持续6拍
    { 3, 909*BEAT_MS_3 },  // 音符17 持续6拍
    { 3, 917*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 919*BEAT_MS_3 },  // 音符36 持续3拍
    { 3, 922*BEAT_MS_3 },  // 音符17 持续1拍
    { 4, 923*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 925*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 927*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 929*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 931*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 933*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 935*BEAT_MS_3 },  // 音符20 持续2拍
    { 1, 937*BEAT_MS_3 },  // 音符22 持续2拍
    { 2, 939*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 941*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 943*BEAT_MS_3 },  // 音符15 持续4拍
    { 2, 949*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 951*BEAT_MS_3 },  // 音符20 持续3拍
    { 2, 954*BEAT_MS_3 },  // 音符19 持续1拍
    { 2, 955*BEAT_MS_3 },  // 音符19 持续2拍
    { 3, 957*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 959*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 961*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 963*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 965*BEAT_MS_3 },  // 音符19 持续2拍
    { 3, 967*BEAT_MS_3 },  // 音符17 持续4拍
    { 4, 973*BEAT_MS_3 },  // 音符15 持续4拍
    { 2, 977*BEAT_MS_3 },  // 音符20 持续2拍
    { 1, 979*BEAT_MS_3 },  // 音符22 持续2拍
    { 3, 981*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 983*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 987*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 989*BEAT_MS_3 },  // 音符24 持续6拍
    { 3, 995*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 997*BEAT_MS_3 },  // 音符24 持续6拍
    { 2, 1003*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 1005*BEAT_MS_3 },  // 音符19 持续4拍
    { 3, 1009*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 1011*BEAT_MS_3 },  // 音符15 持续2拍
    { 4, 1013*BEAT_MS_3 },  // 音符15 持续6拍
    { 3, 1019*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 1021*BEAT_MS_3 },  // 音符17 持续4拍
    { 3, 1033*BEAT_MS_3 },  // 音符17 持续4拍
    { 2, 1037*BEAT_MS_3 },  // 音符20 持续2拍
    { 4, 1039*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 1043*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 1047*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 1051*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 1053*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 1057*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 1061*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 1065*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 1067*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 1069*BEAT_MS_3 },  // 音符15 持续6拍
    { 3, 1075*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 1077*BEAT_MS_3 },  // 音符17 持续4拍
    { 3, 1083*BEAT_MS_3 },  // 音符17 持续4拍
    { 1, 1087*BEAT_MS_3 },  // 音符22 持续3拍
    { 2, 1090*BEAT_MS_3 },  // 音符20 持续3拍
    { 3, 1093*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 1095*BEAT_MS_3 },  // 音符17 持续4拍
    { 3, 1101*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 1103*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 1107*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 1111*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 1115*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 1117*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 1121*BEAT_MS_3 },  // 音符22 持续4拍
    { 2, 1125*BEAT_MS_3 },  // 音符20 持续4拍
    { 3, 1129*BEAT_MS_3 },  // 音符17 持续2拍
    { 3, 1131*BEAT_MS_3 },  // 音符17 持续2拍
    { 4, 1133*BEAT_MS_3 },  // 音符24 持续4拍
    { 3, 1137*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 1139*BEAT_MS_3 },  // 音符24 持续2拍
    { 3, 1141*BEAT_MS_3 },  // 音符25 持续2拍
    { 4, 1143*BEAT_MS_3 },  // 音符24 持续2拍
    { 3, 1145*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 1147*BEAT_MS_3 },  // 音符27 持续2拍
    { 4, 1149*BEAT_MS_3 },  // 音符24 持续6拍
    { 2, 1163*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1164*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1165*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 1168*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 1171*BEAT_MS_3 },  // 音符27 持续6拍
    { 2, 1177*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 1181*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1182*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1183*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 1186*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 1189*BEAT_MS_3 },  // 音符29 持续4拍
    { 1, 1193*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 1197*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1198*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1199*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 1202*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 1205*BEAT_MS_3 },  // 音符30 持续4拍
    { 1, 1209*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 1213*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 1215*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 1217*BEAT_MS_3 },  // 音符27 持续2拍
    { 1, 1219*BEAT_MS_3 },  // 音符29 持续2拍
    { 4, 1221*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 1225*BEAT_MS_3 },  // 音符22 持续6拍
    { 2, 1231*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 1233*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1234*BEAT_MS_3 },  // 音符20 持续2拍
    { 4, 1236*BEAT_MS_3 },  // 音符15 持续2拍
    { 3, 1238*BEAT_MS_3 },  // 音符17 持续1拍
    { 3, 1239*BEAT_MS_3 },  // 音符18 持续1拍
    { 4, 1240*BEAT_MS_3 },  // 音符24 持续2拍
    { 3, 1242*BEAT_MS_3 },  // 音符25 持续1拍
    { 4, 1243*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 1247*BEAT_MS_3 },  // 音符22 持续1拍
    { 3, 1248*BEAT_MS_3 },  // 音符25 持续6拍
    { 2, 1255*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 1257*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 1260*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 1263*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 1267*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 1271*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1272*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1273*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 1276*BEAT_MS_3 },  // 音符25 持续3拍
    { 2, 1279*BEAT_MS_3 },  // 音符27 持续6拍
    { 2, 1285*BEAT_MS_3 },  // 音符27 持续4拍
    { 2, 1289*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1290*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1291*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 1294*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 1297*BEAT_MS_3 },  // 音符29 持续4拍
    { 1, 1301*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 1305*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1306*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1307*BEAT_MS_3 },  // 音符27 持续3拍
    { 3, 1310*BEAT_MS_3 },  // 音符25 持续3拍
    { 1, 1313*BEAT_MS_3 },  // 音符30 持续4拍
    { 1, 1317*BEAT_MS_3 },  // 音符29 持续4拍
    { 2, 1321*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 1323*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 1325*BEAT_MS_3 },  // 音符27 持续2拍
    { 1, 1327*BEAT_MS_3 },  // 音符29 持续2拍
    { 4, 1329*BEAT_MS_3 },  // 音符24 持续4拍
    { 1, 1333*BEAT_MS_3 },  // 音符22 持续6拍
    { 2, 1339*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 1341*BEAT_MS_3 },  // 音符27 持续2拍
    { 2, 1343*BEAT_MS_3 },  // 音符27 持续4拍
    { 3, 1347*BEAT_MS_3 },  // 音符25 持续8拍
    { 2, 1355*BEAT_MS_3 },  // 音符20 持续2拍
    { 2, 1357*BEAT_MS_3 },  // 音符27 持续2拍
    { 2, 1359*BEAT_MS_3 },  // 音符27 持续4拍
    { 3, 1363*BEAT_MS_3 },  // 音符25 持续2拍
    { 2, 1365*BEAT_MS_3 },  // 音符27 持续1拍
    { 2, 1366*BEAT_MS_3 },  // 音符20 持续1拍
    { 2, 1367*BEAT_MS_3 },  // 音符20 持续1拍
    { 3, 1368*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 1370*BEAT_MS_3 },  // 音符20 持续2拍
    { 4, 1372*BEAT_MS_3 },  // 音符24 持续2拍
    { 4, 1374*BEAT_MS_3 },  // 音符24 持续4拍
    { 3, 1378*BEAT_MS_3 },  // 音符25 持续2拍
    { 3, 1380*BEAT_MS_3 },  // 音符25 持续8拍
    { 1, 1400*BEAT_MS_3 },  // 音符29 持续8拍
    { 2, 1408*BEAT_MS_3 },  // 音符27 持续4拍
    { 3, 1420*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 1422*BEAT_MS_3 },  // 音符27 持续2拍
    { 2, 1424*BEAT_MS_3 },  // 音符27 持续4拍
    { 3, 1428*BEAT_MS_3 },  // 音符25 持续4拍
    { 2, 1432*BEAT_MS_3 },  // 音符20 持续2拍
    { 3, 1434*BEAT_MS_3 },  // 音符17 持续2拍
    { 2, 1436*BEAT_MS_3 },  // 音符20 持续2拍
    { 4, 1438*BEAT_MS_3 },  // 音符24 持续2拍
    { 4, 1440*BEAT_MS_3 },  // 音符24 持续4拍
    { 3, 1444*BEAT_MS_3 },  // 音符25 持续2拍
    { 3, 1446*BEAT_MS_3 },  // 音符25 持续8拍
    { 4, 1454*BEAT_MS_3 },  // 音符37 持续0拍
    // === 片段1结束（累计1454拍） ===

};